{
  "experience": [
    {
      "id": 1,
      "company": "Stride Consulting",
      "title": "Software Engineering Intern",
      "date": "2020",
      "field": "Fullstack Development",
      "skills": "",
      "responsibilities": [
        "Collaborated with the team to update, build, and deploy the company’s intranet in Ruby on Rails.",
        "Learned the company’s tech stack to assist in adding and improving website features.",
        "Tested the website using Selenium, Capybara, and Jest testing frameworks."
      ]
    },
    {
      "id": 2,
      "company": "Google",
      "title": "Software Engineer Apprentice",
      "date": "2021 - 2023",
      "skills": "",
      "responsibilities": [
        "Deployed API to allow buyers to specify the state they would like to display their ads on the internet.",
        "Focus on privacy by implementing a feature that excluding small regions and works with an Ariane to ensure it’s safe.",
        "Plan, design, and implement a pipeline to periodically generate event records an 85% faster and index it.",
        "Implemented a fast view generating pipeline to speed up queries of a security RpcSP runtime stats by 87.5%.",
        "Implemented a rolling bloom filter for efficiently deduplicating high cardinality runtime metrics.",
        "Developed and deployed a rolling bloom filter to optimize the deduplication process of high cardinality runtime metrics."
      ]
    },
    {
      "id": 3,
      "company": "Fullstack Academy of Code",
      "title": "Mentor II",
      "date": "2023 - Present",
      "field": "Fullstack Development",
      "skills": "",
      "responsibilities": [
        "Advised 40+ students throughout the Amazon career choice bootcamp program by teaching frontend and backend technology.",
        "Managing team projects including conducting code reviews, concept creation, and technical challenges.",
        "Guided workshops and lectures, contributing real-world insights beyond the standard curriculum."
      ]
    }
  ]
}
